#+PROPERTY: header-args+ :var  MEM_STICK="/media/jj/jj"


*** ~sync-doc~: Show sync info for SUB_FOLDER in PROJECT

#+name: sync-info
#+BEGIN_SRC bash :eval no-export :results output
echo PROJECT=$PROJECT
echo SUB_FOLDER=$SUB_FOLDER
echo MEM_STICK=$MEM_STICK
#+END_SRC

#+RESULTS: show-project
: PROJECT=jrr
: SUB_FOLDER=cad


#+name: sync-doc
#+BEGIN_SRC bash :eval no-export :results output
echo "Running in $(pwd) host '$(hostname)' on $(date)"
echo PROJECT=$PROJECT
echo SUB_FOLDER=$SUB_FOLDER
echo MEM_STICK=$MEM_STICK
ls -ltr $SUB_FOLDER; true
ls -ltr $MEM_STICK/$PROJECT; true
#+END_SRC

*** ~sync-init~: Create directory MEM_STICK/PROJECT 


#+name: sync-init
#+BEGIN_SRC bash :eval no-export :results output
( [ -d $MEM_STICK/$PROJECT ] &&  echo mkdir $MEM_STICK/$PROJECT already exists) || (echo mkdir $MEM_STICK/$PROJECT; mkdir -p $MEM_STICK/$PROJECT )
ls -ltr $MEM_STICK/$PROJECT
#+END_SRC

#+RESULTS: sync-init
: mkdir /media/jj/jj/jrr already exists
: total 0

*** ~sync-two-ways~: Sync SUB_FOLDER to MEM_STICK/PROJECT in two ways

#+call: sync-info()

#+RESULTS:
: PROJECT=jrr
: SUB_FOLDER=cad
: MEM_STICK=/media/jj/jj



#+name: sync-two-ways
#+BEGIN_SRC bash :eval no-export :results output
echo "Running in $(pwd) host '$(hostname)' on $(date)"
echo "rsync SUB_FOLDER=$SUB_FOLDER <----> MEM_STICK/PROJECT=$MEM_STICK/$PROJECT"
find $SUB_FOLDER -name '*~' -delete
find $SUB_FOLDER -name '#*' -delete
find $MEM_STICK/$PROJECT -name '*~' -delete
find $MEM_STICK/$PROJECT -name '#*' -delete
# rm -f *~ $SUB_FOLDER/*~ $MEM_STICK/$PROJECT/*~
# rm -f  $SUB_FOLDER/#* $MEM_STICK/$PROJECT/#*
# rm -f  $SUB_FOLDER/.#* $MEM_STICK/$PROJECT/.#*
# rm -f  $SUB_FOLDER/.~*# $MEM_STICK/$PROJECT/.~*
rsync -a --update --verbose  --checksum --recursive  $SUB_FOLDER/ $MEM_STICK/$PROJECT/
rsync -a --update --verbose  --checksum --recursive  $MEM_STICK/$PROJECT/ $SUB_FOLDER/
ls -ltr $MEM_STICK/$PROJECT  $SUB_FOLDER
#+END_SRC

#+RESULTS: sync-two-ways
#+begin_example
Running in /home/jj/work/jrr host 'eero' on ke 16.7.2025 08.50.02 +0300
rsync SUB_FOLDER=cad <----> MEM_STICK/PROJECT=/media/jj/jj/jrr
sending incremental file list

sent 984 bytes  received 48 bytes  2.064,00 bytes/sec
total size is 861.456  speedup is 834,74
sending incremental file list

sent 833 bytes  received 17 bytes  1.700,00 bytes/sec
total size is 861.456  speedup is 1.013,48
/media/jj/jj/jrr:
total 404
drwxr-xr-x 2 jj jj   4096 kesä   19 09:03 pages
drwxr-xr-x 5 jj jj   4096 heinä   8 14:03 jyrsi
-rw-r--r-- 1 jj jj   2536 heinä  15 10:55 jrr5.nc
-rw-r--r-- 1 jj jj 199517 heinä  15 10:55 jrr5.20250715-105520.FCBak
-rw-r--r-- 1 jj jj 199517 heinä  15 12:26 jrr5.FCStd

cad:
total 369
drwxr-xr-x 2 jj jj      3 kesä   19 09:03 pages
drwxr-xr-x 5 jj jj      5 heinä   8 14:03 jyrsi
-rw-rw-r-- 1 jj jj   2536 heinä  15 10:55 jrr5.nc
-rw-r--r-- 1 jj jj 199517 heinä  15 10:55 jrr5.20250715-105520.FCBak
-rw-rw-r-- 1 jj jj 199517 heinä  15 12:26 jrr5.FCStd
#+end_example



